In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('./bank-additional.csv',sep=',""')
data

/var/folders/db/q45d2_5d0c52zkvrdw9tp0xm0000gn/T/ipykernel_54076/2435851106.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  data = pd.read_csv('./bank-additional.csv',sep=',""')

,"""age","job""""","marital""""","education""""","default""""","housing""""","loan""""","contact""""","month""""","day_of_week""""",...,"campaign""""","pdays""""","previous""""","poutcome""""","emp.var.rate""""","cons.price.idx""""","cons.conf.idx""""","euribor3m""""","nr.employed""""","y"""""""
0,"""30","blue-collar""""","married""""","basic.9y""""","no""""","yes""""","no""""","cellular""""","may""""","fri"""",487,2,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"""39","services""""","single""""","high.school""""","no""""","no""""","no""""","telephone""""","may""""","fri"""",346,4,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"""25","services""""","married""""","high.school""""","no""""","yes""""","no""""","telephone""""","jun""""","wed"""",227,1,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,"""38","services""""","married""""","basic.9y""""","no""""","unknown""""","unknown""""","telephone""""","jun""""","fri"""",17,3,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,"""47","admin.""""","married""""","university.degree""""","no""""","yes""""","no""""","cellular""""","nov""""","mon"""",58,1,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4114,"""30","admin.""""","married""""","basic.6y""""","no""""","yes""""","yes""""","cellular""""","jul""""","thu"""",53,1,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4115,"""39","admin.""""","married""""","high.school""""","no""""","yes""""","no""""","telephone""""","jul""""","fri"""",219,1,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4116,"""27","student""""","single""""","high.school""""","no""""","no""""","no""""","cellular""""","may""""","mon"""",64,2,999,1",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4117,"""58","admin.""""","married""""","high.school""""","no""""","no""""","no""""","cellular""""","aug""""","fri"""",528,1,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4118,"""34","management""""","single""""","high.school""""","no""""","yes""""","no""""","cellular""""","nov""""","wed"""",175,1,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
data[data.columns] = data[data.columns].replace({'"':''}, regex=True)
data

,"""age","job""""","marital""""","education""""","default""""","housing""""","loan""""","contact""""","month""""","day_of_week""""",...,"campaign""""","pdays""""","previous""""","poutcome""""","emp.var.rate""""","cons.price.idx""""","cons.conf.idx""""","euribor3m""""","nr.employed""""","y"""""""
0,30,blue-collar,married,basic.9y,no,yes,no,cellular,may,"fri,487,2,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,39,services,single,high.school,no,no,no,telephone,may,"fri,346,4,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,25,services,married,high.school,no,yes,no,telephone,jun,"wed,227,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,38,services,married,basic.9y,no,unknown,unknown,telephone,jun,"fri,17,3,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,47,admin.,married,university.degree,no,yes,no,cellular,nov,"mon,58,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4114,30,admin.,married,basic.6y,no,yes,yes,cellular,jul,"thu,53,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4115,39,admin.,married,high.school,no,yes,no,telephone,jul,"fri,219,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4116,27,student,single,high.school,no,no,no,cellular,may,"mon,64,2,999,1",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4117,58,admin.,married,high.school,no,no,no,cellular,aug,"fri,528,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4118,34,management,single,high.school,no,yes,no,cellular,nov,"wed,175,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
data.columns = data.columns.str.replace('"','')
data

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,30,blue-collar,married,basic.9y,no,yes,no,cellular,may,"fri,487,2,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,39,services,single,high.school,no,no,no,telephone,may,"fri,346,4,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,25,services,married,high.school,no,yes,no,telephone,jun,"wed,227,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,38,services,married,basic.9y,no,unknown,unknown,telephone,jun,"fri,17,3,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,47,admin.,married,university.degree,no,yes,no,cellular,nov,"mon,58,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4114,30,admin.,married,basic.6y,no,yes,yes,cellular,jul,"thu,53,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4115,39,admin.,married,high.school,no,yes,no,telephone,jul,"fri,219,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4116,27,student,single,high.school,no,no,no,cellular,may,"mon,64,2,999,1",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4117,58,admin.,married,high.school,no,no,no,cellular,aug,"fri,528,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4118,34,management,single,high.school,no,yes,no,cellular,nov,"wed,175,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
attribute = data.loc[:, data.columns.intersection(['age','job','marital','education','housing','loan'])]
numericalAttribute = attribute
attribute

     age          job  marital          education  housing     loan
0     30  blue-collar  married           basic.9y      yes       no
1     39     services   single        high.school       no       no
2     25     services  married        high.school      yes       no
3     38     services  married           basic.9y  unknown  unknown
4     47       admin.  married  university.degree      yes       no
...   ..          ...      ...                ...      ...      ...
4114  30       admin.  married           basic.6y      yes      yes
4115  39       admin.  married        high.school      yes       no
4116  27      student   single        high.school       no       no
4117  58       admin.  married        high.school       no       no
4118  34   management   single        high.school      yes       no

[4119 rows x 6 columns]

In [19]:
frquency = attribute.age.value_counts(normalize=False)
percentage = attribute.age.value_counts(normalize=True)

In [22]:
data2 = {'frequency':frquency,
        'percentage': percentage}

ages = pd.DataFrame(data2)
ages = ages.sort_index(axis= 0,kind='quicksort')
ages

    frequency  percentage
18          3    0.000728
19          1    0.000243
20          4    0.000971
21          7    0.001699
22         10    0.002428
..        ...         ...
81          3    0.000728
82          2    0.000486
85          1    0.000243
86          2    0.000486
88          1    0.000243

[67 rows x 2 columns]

In [24]:
frquency = attribute.job.value_counts(normalize=False)
percentage = attribute.job.value_counts(normalize=True)
data2 = {'frequency':frquency,
        'percentage': percentage}

job = pd.DataFrame(data2)
job = job.sort_values(job.columns[1],kind='quicksort')
job

               frequency  percentage
unknown               39    0.009468
student               82    0.019908
housemaid            110    0.026706
unemployed           111    0.026948
entrepreneur         148    0.035931
self-employed        159    0.038602
retired              166    0.040301
management           324    0.078660
services             393    0.095412
technician           691    0.167759
blue-collar          884    0.214615
admin.              1012    0.245691

In [27]:
frequency = attribute.education.value_counts(normalize=False)
percentage = attribute.education.value_counts(normalize=True)
data2 = {'frequency':frequency,
        'percentage': percentage}

education = pd.DataFrame(data2)
education = education.sort_values(education.columns[1],kind='quicksort')
education

                     frequency  percentage
illiterate                   1    0.000243
unknown                    167    0.040544
basic.6y                   228    0.055353
basic.4y                   429    0.104151
professional.course        535    0.129886
basic.9y                   574    0.139354
high.school                921    0.223598
university.degree         1264    0.306871

In [28]:
frequency = attribute.loan.value_counts(normalize=False)
percentage = attribute.loan.value_counts(normalize=True)
data2 = {'frequency':frequency,
        'percentage': percentage}

loan = pd.DataFrame(data2)
loan = loan.sort_values(loan.columns[1],kind='quicksort')
loan

         frequency  percentage
unknown        105    0.025492
yes            665    0.161447
no            3349    0.813061

In [29]:
frequency = attribute.marital.value_counts(normalize=False)
percentage = attribute.marital.value_counts(normalize=True)
data2 = {'frequency':frequency,
        'percentage': percentage}

marital = pd.DataFrame(data2)
marital = marital.sort_values(marital.columns[1],kind='quicksort')
marital

          frequency  percentage
unknown          11    0.002671
divorced        446    0.108279
single         1153    0.279922
married        2509    0.609128

In [30]:
frequency = attribute.housing.value_counts(normalize=False)
percentage = attribute.housing.value_counts(normalize=True)
data2 = {'frequency':frequency,
        'percentage': percentage}

housing = pd.DataFrame(data2)
housing = housing.sort_values(housing.columns[1],kind='quicksort')
housing

         frequency  percentage
unknown        105    0.025492
no            1839    0.446468
yes           2175    0.528041

CHANGE TO NUMERICAL

In [9]:
numericalAttribute['education'] = attribute['education'].replace({'university.degree': 100,'professional.course':92,'high.school':85,'basic.9y':78,'basic.6y':71,'basic.4y':64,'illiterate':57,'unknown':50 })
numericalAttribute['marital'] = attribute['marital'].replace({'married':100,'single':80,'divorced':70,'unknown':50})
numericalAttribute['job'] = attribute['job'].replace({'entrepreneur':100,'self-employed':95,'management':90,'admin.':85,'retired':80,'technician':75,'services':70,'blue-collar':65,'housemaid':60,'student':55,'unemployed':52,'unknown':50})
numericalAttribute['housing'] = attribute['housing'].replace({'yes':100,'no':55,'unknown':50})
numericalAttribute['loan'] = attribute['loan'].replace({'no':100,'yes':55,'unknown':50})

In [10]:
attribute['age'] = pd.to_numeric(attribute['age'])

In [11]:
rank1=attribute['age'].between(30,34).values
numericalAttribute.loc[rank1, 'age']=100
rank2 = attribute['age'].between(35,39).values
numericalAttribute.loc[rank2,'age'] = 95
rank3 = attribute['age'].between(40,44).values
numericalAttribute.loc[rank3,'age'] = 90
rank4 = attribute['age'].between(45,49).values
numericalAttribute.loc[rank4,'age'] = 85
rank5 = attribute['age'].between(50,56).values
numericalAttribute.loc[rank5,'age'] = 80
rank6 = attribute['age'].between(26,29).values
numericalAttribute.loc[rank6,'age'] = 70
rank7 = attribute['age'].between(18,25).values
numericalAttribute.loc[rank7,'age'] = 65
rank8  =attribute['age'].between(57,60).values
numericalAttribute.loc[rank8,'age'] = 60
rank9 = attribute['age'].between(61,70).values
numericalAttribute.loc[rank9,'age'] = 55
rank10 = attribute['age'].between(71,88).values
numericalAttribute.loc[rank10,'age'] = 50

In [12]:
numericalAttribute

      age  job  marital  education  housing  loan
0     100   65      100         78      100   100
1      95   70       80         85       55   100
2      55   70      100         85      100   100
3      95   70      100         78       50    50
4      50   85      100        100      100   100
...   ...  ...      ...        ...      ...   ...
4114  100   85      100         71      100    55
4115   95   85      100         85      100   100
4116   55   55       80         85       55   100
4117   60   85      100         85       55   100
4118  100   90       80         85      100   100

[4119 rows x 6 columns]

In [14]:
numericalAttribute.to_csv('./numericalAttribute.csv')

Data Corellation

Profile = weight* (age) + weight *(marital) + weight*(education )
weight = 1

activity = job

loanrisk = weight * (housing) + weight* (loan)

In [ ]:
test  = (attribute['age'][1]*0.2) + (attribute['job']*0.3)

In [20]:
data2 = {'test':test,
        'Age':test*2}
# Create the pandas DataFrame
finalData = pd.DataFrame(data2)

In [21]:
finalData

      test   Age
0     39.5  79.0
1     40.0  80.0
2     32.0  64.0
3     40.0  80.0
4     35.5  71.0
...    ...   ...
4114  45.5  91.0
4115  44.5  89.0
4116  27.5  55.0
4117  37.5  75.0
4118  47.0  94.0

[4119 rows x 2 columns]